public class Lesson4 {
	public static void main (String[] args ) {
	    
		/*Задание 6
Создайте число. Определите, является ли число трехзначным. Определите, является
ли его последняя цифра семеркой. Определите, является ли число четным.*/
	    int a = 322;

			if (a >= 100)
			if (a < 1000) {
               System.out.println("YES");
	        }else {
			   System.out.println("NO");
			}
			if (a % 2 == 0) {
			   System.out.println("YES");
            }else 
               {System.out.println("NO");
			}
		 
		 
			
		
	
}
}